x <- 10                   # 숫자 데이터 10을 x 변수에 할당
x                         # x 변수 조회

x1 <- c(10, 20, 30)       # 숫자 3개(10, 20, 30)로 구성된 x1 변수 생성
x1                        # x1 변수 조회

x2 <- c(10:15)            # 데이터 10~15의 연속된 숫자로 구성된 x2 변수 생성
x2                        # x2 변수 조회

x3 <- seq(10, 20)         # 데이터 10~15의 연속된 숫자로 구성된 x3 변수 생성
x3                        # x3 변수 조회

x4 <- seq(1, 10, by = 2)  # 데이터 1~10에서 2 간격으로 연속된 숫자로 구성된 x4 변수 생성
x4                        # x4 변수 조회

y <- "Hi"                             # 문자 데이터 "Hi"를 y 변수에 할당
y                                     # y 변수 조회

y1 <- c("Hello", "Hi", "Hello ~ !")   # 문자 데이터 "Hi"를 y 변수에 할당
y1                                    # y1 변수 조회

